#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-east-1:056212709895:cluster/app_cluster]
aws_ecr_repository.repo: Refreshing state... [id=app_repo]
aws_vpc.vpc: Refreshing state... [id=vpc-016569ebb573e46e7]
aws_internet_gateway.gw: Refreshing state... [id=igw-0c8b459f2a42629d5]
aws_subnet.sn3: Refreshing state... [id=subnet-0605ca2f97a7cc681]
aws_subnet.sn2: Refreshing state... [id=subnet-023eb2fdcd85ce1d6]
aws_subnet.sn1: Refreshing state... [id=subnet-0978129e6cc45a522]
aws_security_group.sg: Refreshing state... [id=sg-02ebda9b4f02bfaa3]
aws_route_table.rt: Refreshing state... [id=rtb-0ab5a79f8861c0201]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:056212709895:service/app_cluster/app_service]
aws_route_table_association.route3: Refreshing state... [id=rtbassoc-08bc35014fc1a59cd]
aws_route_table_association.route2: Refreshing state... [id=rtbassoc-0efd137f02cac9615]
aws_route_table_association.route1: Refreshing state... [id=rtbassoc-0838b1d96d909abac]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:056212709895:service/app_cluster/app_service"
        name                               = "app_service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:056212709895:task-definition/app:18" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.td will be created
  + resource "aws_ecs_task_definition" "td" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + essential    = true
                  + image        = "056212709895.dkr.ecr.us-east-1.amazonaws.com/app_repo"
                  + memory       = 512
                  + name         = "app"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::056212709895:role/ecsTaskExecutionRole"
      + family                   = "app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::056212709895:role/ecsTaskExecutionRole"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vperezcerv, Action: `pull_request`*